taskt/Core/Automation/Commands/WindowGroup/IWindowWaitTimeBetweenFindAndActionProperties_[%reverse%].dot
digraph "taskt.Core.Automation.Commands.IWindowWaitTimeBetweenFindAndActionProperties" {
    rankdir="TB";
    node [
        shape="box",
        fontname="Meiryo UI",
        fontsize="12pt"
    ];

"taskt.Core.Automation.Commands.IWindowNamesActionProperties" [ label="IWindowNamesActionProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IWindowWaitTimeBetweenFindAndActionProperties" [ label="IWindowWaitTimeBetweenFindAndActionProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IWindowHandleActionPropeties" [ label="IWindowHandleActionPropeties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.IOneWindowNameActionProperties" [ label="IOneWindowNameActionProperties", shape="ellipse", style="dashed", ];
"taskt.Core.Automation.Commands.AWindowNamesActionCommnads" [ label="AWindowNamesActionCommnads", style="dashed", ];
"taskt.Core.Automation.Commands.AWindowHandleActionCommands" [ label="AWindowHandleActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.AOneWindowNameActionCommands" [ label="AOneWindowNameActionCommands", style="dashed", ];
"taskt.Core.Automation.Commands.SetWindowsStateCommand" [ label="SetWindowsStateCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ResizeWindowsCommand" [ label="ResizeWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveWindowsCommand" [ label="MoveWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CloseWindowsCommand" [ label="CloseWindowsCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.EnterKeysFromWindowHandleCommand" [ label="EnterKeysFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.EnterShortcutKeyFromWindowHandleCommand" [ label="EnterShortcutKeyFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SendAdvancedKeyStrokesFromWindowHandleCommand" [ label="SendAdvancedKeyStrokesFromWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CloseWindowByWindowHandle" [ label="CloseWindowByWindowHandle", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveWindowByWindowHandleCommand" [ label="MoveWindowByWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ResizeWindowByWindowHandleCommand" [ label="ResizeWindowByWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetWindowStateByWindowHandleCommand" [ label="SetWindowStateByWindowHandleCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SetOneWindowStateCommand" [ label="SetOneWindowStateCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.ResizeOneWindowCommand" [ label="ResizeOneWindowCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.MoveOneWindowCommand" [ label="MoveOneWindowCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.CloseOneWindowCommand" [ label="CloseOneWindowCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.EnterShortcutKeyCommand" [ label="EnterShortcutKeyCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.SendAdvancedKeyStrokesCommand" [ label="SendAdvancedKeyStrokesCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.EnterKeysCommand" [ label="EnterKeysCommand", shape="parallelogram", style="bold", ];
"taskt.Core.Automation.Commands.TakeScreenshotCommand" [ label="TakeScreenshotCommand", shape="parallelogram", style="bold", ];

"taskt.Core.Automation.Commands.IWindowNamesActionProperties" -> "taskt.Core.Automation.Commands.IWindowWaitTimeBetweenFindAndActionProperties";
"taskt.Core.Automation.Commands.IWindowHandleActionPropeties" -> "taskt.Core.Automation.Commands.IWindowWaitTimeBetweenFindAndActionProperties";
"taskt.Core.Automation.Commands.IOneWindowNameActionProperties" -> "taskt.Core.Automation.Commands.IWindowWaitTimeBetweenFindAndActionProperties";
"taskt.Core.Automation.Commands.AWindowNamesActionCommnads" -> "taskt.Core.Automation.Commands.IWindowNamesActionProperties";
"taskt.Core.Automation.Commands.AWindowHandleActionCommands" -> "taskt.Core.Automation.Commands.IWindowHandleActionPropeties";
"taskt.Core.Automation.Commands.AOneWindowNameActionCommands" -> "taskt.Core.Automation.Commands.IOneWindowNameActionProperties";
"taskt.Core.Automation.Commands.SetWindowsStateCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.ResizeWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.MoveWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.CloseWindowsCommand" -> "taskt.Core.Automation.Commands.AWindowNamesActionCommnads";
"taskt.Core.Automation.Commands.EnterKeysFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.EnterShortcutKeyFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.SendAdvancedKeyStrokesFromWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.CloseWindowByWindowHandle" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.MoveWindowByWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.ResizeWindowByWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.SetWindowStateByWindowHandleCommand" -> "taskt.Core.Automation.Commands.AWindowHandleActionCommands";
"taskt.Core.Automation.Commands.SetOneWindowStateCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.ResizeOneWindowCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.MoveOneWindowCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.CloseOneWindowCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.EnterShortcutKeyCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.SendAdvancedKeyStrokesCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.EnterKeysCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
"taskt.Core.Automation.Commands.TakeScreenshotCommand" -> "taskt.Core.Automation.Commands.AOneWindowNameActionCommands";
}
